driver-tests/bpelse/assign/AssignJbi/test/echoIDDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoIDDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoIDDataType">
    <string>ID</string>
    <normalizedString>ID</normalizedString>
    <token>ID</token>
    <base64Binary>ID</base64Binary>
    <hexBinary>ID</hexBinary>
    <integer>ID</integer>
    <positiveInteger>ID</positiveInteger>
    <negativeInteger>ID</negativeInteger>
    <nonNegativeInteger>ID</nonNegativeInteger>
    <nonPositiveInteger>ID</nonPositiveInteger>
    <long>ID</long>
    <unsignedLong>ID</unsignedLong>
    <int>ID</int>
    <unsignedInt>ID</unsignedInt>
    <short>ID</short>
    <unsignedShort>ID</unsignedShort>
    <byte>ID</byte>
    <unsignedByte>ID</unsignedByte>
    <decimal>ID</decimal>
    <float>ID</float>
    <double>ID</double>
    <boolean>ID</boolean>
    <duration>ID</duration>
    <dateTime>ID</dateTime>
    <date>ID</date>
    <time>ID</time>
    <gYear>ID</gYear>
    <gYearMonth>ID</gYearMonth>
    <gMonth>ID</gMonth>
    <gMonthDay>ID</gMonthDay>
    <gDay>ID</gDay>
    <Name>ID</Name>
    <QName>ID</QName>
    <NCName>ID</NCName>
    <anyURI>ID</anyURI>
    <language>ID</language>
    <ID>ID</ID>
    <IDREF>ID</IDREF>
    <IDREFS>ID</IDREFS>
    <ENTITY>ID</ENTITY>
    <ENTITIES>ID</ENTITIES>
    <NMTOKEN>ID</NMTOKEN>
    <NMTOKENS>ID</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
